text = 'Природа – це безмежне джерело краси й натхнення. Вона вражає різноманіттям форм: від величних гір і безкраїх океанів до затишних лісів і барвистих лугів. Природа дарує нам відчуття спокою і гармонії, запрошує слухати шепіт листя, спів птахів і дзюрчання струмків. У кожній краплі роси, кожній квітці та кожному промені сонця закладена сила життя. Відповідальність людини — зберегти цю красу, піклуватися про навколишнє середовище, щоб наступні покоління могли насолоджуватися дивовижним світом природи так само, як і ми.'
print("Перетворення рядка до верхнього регістру:")
upper_text = (text.upper())   #Приводимо текст до верхнього регістру
print(upper_text)

print("Довжина рядка:")
len_text = len(text)       #Застосовуємо функцію щоб дізнатися довжину рядка
print(len_text)

print('Заміна слів"Природа" на "Світ":')
replace_text = (text.replace('Природа','Світ'))     #Заміняємо всі слова "Природа" на "Світ"
print(replace_text)

print("Пошук підрядка в рядку. Повертає номер першого -1:")
find_text = (text.find('натхнення'))        #Пошук слова "натхнення" в тексті
print(find_text)
